#### Task 1- Create a pandas dataframe (DataFrame name as 'df') (10 observation and 5 features)

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [6]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Emma", "Frank", "Grace", "Hannah", "Isaac", "Jack"],
    "Age": [25, 32, 19, 47, 28, 40, 22, 30, 35, 29],
    "Gender": ["Female", "Male", "Male", "Male", "Female", "Male", "Female", "Female", "Male", "Male"],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Miami", "San Francisco", "Boston", "Seattle", "Austin", "Denver"],
    "Score": [85, 92, 78, 65, 89, 76, 95, 82, 70, 88]
}

df = pd.DataFrame(data)

In [7]:
df

      Name  Age  Gender           City  Score
0    Alice   25  Female       New York     85
1      Bob   32    Male    Los Angeles     92
2  Charlie   19    Male        Chicago     78
3    David   47    Male        Houston     65
4     Emma   28  Female          Miami     89
5    Frank   40    Male  San Francisco     76
6    Grace   22  Female         Boston     95
7   Hannah   30  Female        Seattle     82
8    Isaac   35    Male         Austin     70
9     Jack   29    Male         Denver     88

#### Task- 2 Check the info of 'df'

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Age     10 non-null     int64
 2   Gender  10 non-null     object
 3   City    10 non-null     object
 4   Score   10 non-null     int64
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

#### Task 3- Check the descriptive statistics of 'df'

In [9]:
df.describe()

             Age      Score
count  10.000000  10.000000
mean   30.700000  82.000000
std     8.353974   9.706813
min    19.000000  65.000000
25%    25.750000  76.500000
50%    29.500000  83.500000
75%    34.250000  88.750000
max    47.000000  95.000000

#### Task 4- check the 4th index observation with 'loc' slicing operator.

In [10]:
df.loc[4]

Name        Emma
Age           28
Gender    Female
City       Miami
Score         89
Name: 4, dtype: object

#### Task 5 - Check the null values in your 'df'

In [11]:
df.isnull().sum()

Name      0
Age       0
Gender    0
City      0
Score     0
dtype: int64